{
  "nav.home": "Home",
  "nav.services": "Services",
  "nav.stack": "Stack",
  "nav.projects": "Projects",
  "cta.contactMe": "Contact me",

  "contact.title": "Contact",
  "contact.form.name": "Full name",
  "contact.form.email": "Email",
  "contact.form.subject": "Subject",
  "contact.form.message": "Message",
  "contact.form.submit": "Send",
  "contact.form.sending": "Sending...",
  "contact.success.title": "Success",
  "contact.success.message": "Message sent successfully.",
  "contact.error.title": "Error",
  "contact.error.message": "An error occurred. Please try again later.",

  "home.greeting": "Hi, I'm",
  "home.name": "Görkem",
  "home.surname": "Kurtkaya",
  "home.role": "I'm a",
  "home.role.title": "Software Developer",
  "home.description": "I am a backend-focused software developer with strong fullstack experience. While my main interest lies in building scalable backend systems using technologies such as NestJS, Node.js, Redis, Kafka, RabbitMQ, and PostgreSQL, I have also developed fullstack projects with React, Next.js, MongoDB, Supabase, Firebase, and Docker. Having worked on microservices, real-time communication, and cloud-based deployments (GCP), I am eager to bring my knowledge and passion to large-scale projects while continuously improving myself.",
  "home.cta.contact": "Contact me",
  "home.cta.download": "Download CV",

  "stack.title": "Tech Stack",

  "services.title": "Services",
  "services.frontend.title": "Frontend Development",
  "services.frontend.description": "I develop modern, responsive, and user-friendly interfaces with React.js and Next.js. I’m skilled in HTML5, CSS3, JavaScript, and TypeScript, creating cross-platform experiences that work seamlessly on all devices. I use state management tools like Redux and Context API, integrate APIs for smooth data flow, and design clean UIs with Tailwind CSS and Ant Design to deliver high-quality user experiences.",
  "services.backend.title": "Backend Development",
  "services.backend.description": "I specialize in building scalable and secure backend systems with Node.js and NestJS. My experience includes designing RESTful APIs, managing PostgreSQL and MongoDB databases, and working with Redis, Kafka, and RabbitMQ for real-time data and message queues. I also develop microservices architectures, containerize applications with Docker, and deploy to cloud platforms like GCP and AWS, ensuring high performance and reliability.",

  "projects.title": "Projects",
  "projects.viewDetails": "View details",
  "projects.showMore": "Show more",
  "projects.showLess": "Show less",

  "projectDetail.back": "Back",
  "projectDetail.summary": "Summary",
  "projectDetail.technologies": "Technologies",
  "projectDetail.detailedCode": "Detailed Code",

  "footer.copyright": "© {year} Görkem Kurtkaya — Developed by."
}
